InformationRegisters/СоставИНастройкиОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СоставИНастройкиОтчетов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидЗначения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗначенияНастроекОтчетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НастройкиОтчетов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Субъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отчеты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПредоставленияОтчетности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиОтчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СоставИНастройкиОтчетов/Ext/RecordSetModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Индекс = ЭтотОбъект.Индекс(Запись);
		
		// Настройка состава отчетов.
		Если Запись.Настройка = ПланыВидовХарактеристик.НастройкиОтчетов.Формировать
			И Запись.Приоритет <> 12
			И Запись.Приоритет <> 18
			И Запись.Приоритет <> 24 Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В строке %1 настройка состава отчетов не соответствует виду настройки!", Индекс),,,,Отказ);
			Продолжить;
			
		КонецЕсли;
		
		// Субъект.
		Если Запись.Приоритет > 6 Тогда
			
			// не заполнили.
			Если НЕ ЗначениеЗаполнено(Запись.Субъект) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В строке %1 не выбран субъект настройки!", Индекс),,,,Отказ);
			// должен быть клиент (ФЛ/ЮЛ/ПИФ).
			ИначеЕсли Запись.Приоритет < 19
						И ТипЗнч(Запись.Субъект) <> Тип("СправочникСсылка.ЮрФизЛица")
						И ТипЗнч(Запись.Субъект) <> Тип("СправочникСсылка.ПаевыеИнвестиционныеФонды") Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В строке %1 в качестве субъекта должен быть указан клиент!", Индекс),,,,Отказ);
			// должен быть договор (счет ДУ).
			ИначеЕсли Запись.Приоритет > 18
						И ТипЗнч(Запись.Субъект) <> Тип("СправочникСсылка.СчетаДоверительногоУправления") Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В строке %1 в качестве субъекта должен быть указан договор!", Индекс),,,,Отказ);
			КонецЕсли;
			
		// должен быть не заполнен.
		ИначеЕсли ЗначениеЗаполнено(Запись.Субъект) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В строке %1 субъект должен быть пустым!", Индекс),,,,Отказ);
		КонецЕсли;
		
		// Вид договора.
		Если Запись.Приоритет > 12 И Запись.Приоритет < 19 Тогда
			
			// не заполнили.
			Если НЕ ЗначениеЗаполнено(Запись.ВидДоговора) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В строке %1 не выбран вид договора клиента!", Индекс),,,,Отказ);
			КонецЕсли;
			
		// должен быть не заполнен.
		ИначеЕсли ЗначениеЗаполнено(Запись.ВидДоговора) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В строке %1 вид договора клиента должен быть пустым!", Индекс),,,,Отказ);
		КонецЕсли;
		
		// Периодичность.
		Если Запись.Приоритет / 2  = Цел(Запись.Приоритет / 2) Тогда
			
			// не заполнили.
			Если НЕ ЗначениеЗаполнено(Запись.Периодичность) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В строке %1 не выбрана периодичность!", Индекс),,,,Отказ);
			КонецЕсли;
			
		// должна быть не заполнена.
		ИначеЕсли ЗначениеЗаполнено(Запись.Периодичность) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В строке %1 периодичность должна быть пустой!", Индекс),,,,Отказ);
		КонецЕсли;
		
		// Отчет.
		Если Запись.Приоритет > 2 И Запись.Приоритет < 7
			ИЛИ Запись.Приоритет > 8 И Запись.Приоритет < 13 
			ИЛИ Запись.Приоритет > 14 И Запись.Приоритет < 19
			ИЛИ Запись.Приоритет > 20 Тогда
			
			// не заполнили.
			Если НЕ ЗначениеЗаполнено(Запись.Отчет) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В строке %1 не выбран отчет!", Индекс),,,,Отказ);
			ИначеЕсли (Запись.Приоритет = 2 ИЛИ Запись.Приоритет = 3
				ИЛИ Запись.Приоритет = 9 ИЛИ Запись.Приоритет = 10
				ИЛИ Запись.Приоритет = 15 ИЛИ Запись.Приоритет = 16
				ИЛИ Запись.Приоритет = 21 ИЛИ Запись.Приоритет = 22)
				И НЕ Запись.Отчет.ЭтоГруппа Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В строке %1 в качестве отчета должа быть указана группа отчетов!", Индекс),,,,Отказ);
			ИначеЕсли (Запись.Приоритет = 5 ИЛИ Запись.Приоритет = 6
				ИЛИ Запись.Приоритет = 11 ИЛИ Запись.Приоритет = 12
				ИЛИ Запись.Приоритет = 17 ИЛИ Запись.Приоритет = 18
				ИЛИ Запись.Приоритет = 23 ИЛИ Запись.Приоритет = 24)
				И Запись.Отчет.ЭтоГруппа Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В строке %1 в качестве отчета должен быть указан отчет, а не группа отчетов!", Индекс),,,,Отказ);
			КонецЕсли;
			
		// должен быть не заполнен.
		ИначеЕсли ЗначениеЗаполнено(Запись.Отчет) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В строке %1 отчет должен быть пустым!", Индекс),,,,Отказ);
		КонецЕсли;
		
		// Значение.
		Если Запись.ВидЗначения = Перечисления.ВидыЗначенияНастроекОтчетов.ПоУмолчанию
			И ЗначениеЗаполнено(Запись.Значение) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В строке %1 выбран тип значения 'По умолчанию' и указано значение!", Индекс),,,,Отказ);
		ИначеЕсли Запись.Настройка = ПланыВидовХарактеристик.НастройкиОтчетов.Формировать
			И Запись.ВидЗначения = Перечисления.ВидыЗначенияНастроекОтчетов.Собственное
			И НЕ ЗначениеЗаполнено(Запись.Значение) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("В строке %1 не указано значение настройки!", Индекс),,,,Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если Отбор.Количество() = 0
		ИЛИ ЭтотОбъект.ДополнительныеСвойства.Свойство("ОтключитьКонтрольИОповещения")
			И ЗначениеЗаполнено(ЭтотОбъект.ДополнительныеСвойства.ОтключитьКонтрольИОповещения)
			И ЭтотОбъект.ДополнительныеСвойства.ОтключитьКонтрольИОповещения Тогда
		Возврат;
	КонецЕсли;
	
	УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// Проверяем, что не добавлены записи, дублирующие действующие и/или будущие настройки
	#Область Проверка_дублей

	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("НаборЗаписей",	ЭтотОбъект.Выгрузить());
	
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НаборЗаписей.Период КАК Период,
		|	НаборЗаписей.Организация КАК Организация,
		|	НаборЗаписей.Субъект КАК Субъект,
		|	НаборЗаписей.ВидДоговора КАК ВидДоговора,
		|	НаборЗаписей.Отчет КАК Отчет,
		|	НаборЗаписей.Периодичность КАК Периодичность,
		|	НаборЗаписей.Настройка КАК Настройка,
		|	НаборЗаписей.ВидЗначения КАК ВидЗначения,
		|	НаборЗаписей.Значение КАК Значение,
		|	НаборЗаписей.Приоритет КАК Приоритет
		|ПОМЕСТИТЬ _НаборЗаписей
		|ИЗ
		|	&НаборЗаписей КАК НаборЗаписей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СоставИНастройкиОтчетов.Период КАК Период,
		|	СоставИНастройкиОтчетов.Организация КАК Организация,
		|	СоставИНастройкиОтчетов.Субъект КАК Субъект,
		|	СоставИНастройкиОтчетов.ВидДоговора КАК ВидДоговора,
		|	СоставИНастройкиОтчетов.Отчет КАК Отчет,
		|	СоставИНастройкиОтчетов.Периодичность КАК Периодичность,
		|	СоставИНастройкиОтчетов.Настройка КАК Настройка,
		|	СоставИНастройкиОтчетов.ВидЗначения КАК ВидЗначения,
		|	СоставИНастройкиОтчетов.Значение КАК Значение,
		|	СоставИНастройкиОтчетов.Приоритет КАК Приоритет
		|ПОМЕСТИТЬ _ДанныеРегистра
		|ИЗ
		|	РегистрСведений.СоставИНастройкиОтчетов КАК СоставИНастройкиОтчетов
		|ГДЕ
		|	(СоставИНастройкиОтчетов.Организация, СоставИНастройкиОтчетов.Субъект, СоставИНастройкиОтчетов.ВидДоговора, СоставИНастройкиОтчетов.Отчет, СоставИНастройкиОтчетов.Периодичность, СоставИНастройкиОтчетов.Настройка) В
		|			(ВЫБРАТЬ
		|				_НаборЗаписей.Организация КАК Организация,
		|				_НаборЗаписей.Субъект КАК Субъект,
		|				_НаборЗаписей.ВидДоговора КАК ВидДоговора,
		|				_НаборЗаписей.Отчет КАК Отчет,
		|				_НаборЗаписей.Периодичность КАК Периодичность,
		|				_НаборЗаписей.Настройка КАК Настройка
		|			ИЗ
		|				_НаборЗаписей КАК _НаборЗаписей)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_НаборЗаписей.Период КАК Период,
		|	_НаборЗаписей.Организация КАК Организация,
		|	_НаборЗаписей.Субъект КАК Субъект,
		|	_НаборЗаписей.ВидДоговора КАК ВидДоговора,
		|	_НаборЗаписей.Отчет КАК Отчет,
		|	_НаборЗаписей.Периодичность КАК Периодичность,
		|	_НаборЗаписей.Настройка КАК Настройка,
		|	_НаборЗаписей.ВидЗначения КАК ВидЗначения,
		|	_НаборЗаписей.Значение КАК Значение,
		|	_НаборЗаписей.Приоритет КАК Приоритет,
		|	МИНИМУМ(_ДанныеРегистра.Период) КАК Дата
		|ПОМЕСТИТЬ _ДатыСледующихЗаписей
		|ИЗ
		|	_НаборЗаписей КАК _НаборЗаписей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДанныеРегистра КАК _ДанныеРегистра
		|		ПО _НаборЗаписей.Организация = _ДанныеРегистра.Организация
		|			И _НаборЗаписей.Субъект = _ДанныеРегистра.Субъект
		|			И _НаборЗаписей.ВидДоговора = _ДанныеРегистра.ВидДоговора
		|			И _НаборЗаписей.Отчет = _ДанныеРегистра.Отчет
		|			И _НаборЗаписей.Периодичность = _ДанныеРегистра.Периодичность
		|			И _НаборЗаписей.Настройка = _ДанныеРегистра.Настройка
		|			И _НаборЗаписей.Период < _ДанныеРегистра.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	_НаборЗаписей.Период,
		|	_НаборЗаписей.Организация,
		|	_НаборЗаписей.Субъект,
		|	_НаборЗаписей.ВидДоговора,
		|	_НаборЗаписей.Отчет,
		|	_НаборЗаписей.Периодичность,
		|	_НаборЗаписей.Настройка,
		|	_НаборЗаписей.ВидЗначения,
		|	_НаборЗаписей.Значение,
		|	_НаборЗаписей.Приоритет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_НаборЗаписей.Период КАК Период,
		|	_НаборЗаписей.Организация КАК Организация,
		|	_НаборЗаписей.Субъект КАК Субъект,
		|	_НаборЗаписей.ВидДоговора КАК ВидДоговора,
		|	_НаборЗаписей.Отчет КАК Отчет,
		|	_НаборЗаписей.Периодичность КАК Периодичность,
		|	_НаборЗаписей.Настройка КАК Настройка,
		|	_НаборЗаписей.ВидЗначения КАК ВидЗначения,
		|	_НаборЗаписей.Значение КАК Значение,
		|	_НаборЗаписей.Приоритет КАК Приоритет,
		|	МАКСИМУМ(_ДанныеРегистра.Период) КАК Дата
		|ПОМЕСТИТЬ _ДатыПредыдущихЗаписей
		|ИЗ
		|	_НаборЗаписей КАК _НаборЗаписей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДанныеРегистра КАК _ДанныеРегистра
		|		ПО _НаборЗаписей.Организация = _ДанныеРегистра.Организация
		|			И _НаборЗаписей.Субъект = _ДанныеРегистра.Субъект
		|			И _НаборЗаписей.ВидДоговора = _ДанныеРегистра.ВидДоговора
		|			И _НаборЗаписей.Отчет = _ДанныеРегистра.Отчет
		|			И _НаборЗаписей.Периодичность = _ДанныеРегистра.Периодичность
		|			И _НаборЗаписей.Настройка = _ДанныеРегистра.Настройка
		|			И _НаборЗаписей.Период > _ДанныеРегистра.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	_НаборЗаписей.Период,
		|	_НаборЗаписей.Организация,
		|	_НаборЗаписей.Субъект,
		|	_НаборЗаписей.ВидДоговора,
		|	_НаборЗаписей.Отчет,
		|	_НаборЗаписей.Периодичность,
		|	_НаборЗаписей.Настройка,
		|	_НаборЗаписей.ВидЗначения,
		|	_НаборЗаписей.Значение,
		|	_НаборЗаписей.Приоритет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДатыСледующихЗаписей.Период КАК Период,
		|	_ДатыСледующихЗаписей.Организация КАК Организация,
		|	_ДатыСледующихЗаписей.Субъект КАК Субъект,
		|	_ДатыСледующихЗаписей.ВидДоговора КАК ВидДоговора,
		|	_ДатыСледующихЗаписей.Отчет КАК Отчет,
		|	_ДатыСледующихЗаписей.Периодичность КАК Периодичность,
		|	_ДатыСледующихЗаписей.Настройка КАК Настройка,
		|	_ДатыСледующихЗаписей.ВидЗначения КАК ВидЗначения,
		|	_ДатыСледующихЗаписей.Значение КАК Значение,
		|	_ДатыСледующихЗаписей.Приоритет КАК Приоритет,
		|	_ДатыСледующихЗаписей.Дата КАК Дата
		|ИЗ
		|	_ДатыСледующихЗаписей КАК _ДатыСледующихЗаписей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДанныеРегистра КАК _ДанныеРегистра
		|		ПО _ДатыСледующихЗаписей.Дата = _ДанныеРегистра.Период
		|			И _ДатыСледующихЗаписей.Организация = _ДанныеРегистра.Организация
		|			И _ДатыСледующихЗаписей.Субъект = _ДанныеРегистра.Субъект
		|			И _ДатыСледующихЗаписей.ВидДоговора = _ДанныеРегистра.ВидДоговора
		|			И _ДатыСледующихЗаписей.Отчет = _ДанныеРегистра.Отчет
		|			И _ДатыСледующихЗаписей.Периодичность = _ДанныеРегистра.Периодичность
		|			И _ДатыСледующихЗаписей.Настройка = _ДанныеРегистра.Настройка
		|			И _ДатыСледующихЗаписей.ВидЗначения = _ДанныеРегистра.ВидЗначения
		|			И _ДатыСледующихЗаписей.Значение = _ДанныеРегистра.Значение
		|			И _ДатыСледующихЗаписей.Приоритет = _ДанныеРегистра.Приоритет
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_ДатыПредыдущихЗаписей.Период,
		|	_ДатыПредыдущихЗаписей.Организация,
		|	_ДатыПредыдущихЗаписей.Субъект,
		|	_ДатыПредыдущихЗаписей.ВидДоговора,
		|	_ДатыПредыдущихЗаписей.Отчет,
		|	_ДатыПредыдущихЗаписей.Периодичность,
		|	_ДатыПредыдущихЗаписей.Настройка,
		|	_ДатыПредыдущихЗаписей.ВидЗначения,
		|	_ДатыПредыдущихЗаписей.Значение,
		|	_ДатыПредыдущихЗаписей.Приоритет,
		|	_ДатыПредыдущихЗаписей.Дата
		|ИЗ
		|	_ДатыПредыдущихЗаписей КАК _ДатыПредыдущихЗаписей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДанныеРегистра КАК _ДанныеРегистра
		|		ПО _ДатыПредыдущихЗаписей.Дата = _ДанныеРегистра.Период
		|			И _ДатыПредыдущихЗаписей.Организация = _ДанныеРегистра.Организация
		|			И _ДатыПредыдущихЗаписей.Субъект = _ДанныеРегистра.Субъект
		|			И _ДатыПредыдущихЗаписей.ВидДоговора = _ДанныеРегистра.ВидДоговора
		|			И _ДатыПредыдущихЗаписей.Отчет = _ДанныеРегистра.Отчет
		|			И _ДатыПредыдущихЗаписей.Периодичность = _ДанныеРегистра.Периодичность
		|			И _ДатыПредыдущихЗаписей.Настройка = _ДанныеРегистра.Настройка
		|			И _ДатыПредыдущихЗаписей.ВидЗначения = _ДанныеРегистра.ВидЗначения
		|			И _ДатыПредыдущихЗаписей.Значение = _ДанныеРегистра.Значение
		|			И _ДатыПредыдущихЗаписей.Приоритет = _ДанныеРегистра.Приоритет";
	#КонецОбласти
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		
		ТекстСообщения = "Запись невозможна! Обнаружено добавление записей, дублирующих действующие и / или будущие значения настроек:";
		
		Пока Выборка.Следующий() Цикл
			
			ТекстСообщения = ТекстСообщения + СтрШаблон("
								|Организация: '%1'
								|Субъект: '%2'
								|Вид договора: '%3'
								|Отчет: '%4'
								|Периодичность: '%5'
								|Настройка: '%6'
								|Вид значения: '%7'
								|Значение: '%8'
								|Дата дублируемого значения: '%9'.",
								Выборка.Организация,
								Выборка.Субъект,
								Выборка.ВидДоговора,
								Выборка.Отчет,
								Выборка.Периодичность,
								Выборка.Настройка,
								Выборка.ВидЗначения,
								Выборка.Значение,
								Выборка.Дата);
			
		КонецЦикла;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			
	КонецЕсли;
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	#КонецОбласти
	
	// Проверяем, что первая по времени настройка Формировать установлена в Истина
	#Область Проверка_первых_записей_формирования
	
	ТаблицаЗаписей = ЭтотОбъект.Выгрузить();
	ТаблицаЗаписей.Сортировать("Период");
	НайденныеЗаписиФормировать = ТаблицаЗаписей.НайтиСтроки(Новый Структура("Настройка", ПланыВидовХарактеристик.НастройкиОтчетов.Формировать));
	Если НайденныеЗаписиФормировать.Количество() = 0 Или НайденныеЗаписиФормировать[0].Значение = Истина Тогда
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НаборЗаписей", ТаблицаЗаписей);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НаборЗаписей.Период КАК Период,
		|	НаборЗаписей.Организация КАК Организация,
		|	НаборЗаписей.Субъект КАК Субъект,
		|	НаборЗаписей.ВидДоговора КАК ВидДоговора,
		|	НаборЗаписей.Отчет КАК Отчет,
		|	НаборЗаписей.Периодичность КАК Периодичность,
		|	НаборЗаписей.Настройка КАК Настройка,
		|	НаборЗаписей.ВидЗначения КАК ВидЗначения,
		|	НаборЗаписей.Значение КАК Значение,
		|	НаборЗаписей.Приоритет КАК Приоритет
		|ПОМЕСТИТЬ _НаборЗаписей
		|ИЗ
		|	&НаборЗаписей КАК НаборЗаписей
		|ГДЕ
		|	НаборЗаписей.Настройка = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиОтчетов.Формировать)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МИНИМУМ(СоставИНастройкиОтчетов.Период) КАК Период,
		|	СоставИНастройкиОтчетов.Организация КАК Организация,
		|	СоставИНастройкиОтчетов.Субъект КАК Субъект,
		|	СоставИНастройкиОтчетов.ВидДоговора КАК ВидДоговора,
		|	СоставИНастройкиОтчетов.Отчет КАК Отчет,
		|	СоставИНастройкиОтчетов.Периодичность КАК Периодичность,
		|	СоставИНастройкиОтчетов.Настройка КАК Настройка,
		|	СоставИНастройкиОтчетов.ВидЗначения КАК ВидЗначения,
		|	СоставИНастройкиОтчетов.Значение КАК Значение,
		|	СоставИНастройкиОтчетов.Приоритет КАК Приоритет
		|ПОМЕСТИТЬ _ПерваяСтрокаФормировать
		|ИЗ
		|	РегистрСведений.СоставИНастройкиОтчетов КАК СоставИНастройкиОтчетов
		|ГДЕ
		|	(СоставИНастройкиОтчетов.Организация, СоставИНастройкиОтчетов.Субъект, СоставИНастройкиОтчетов.ВидДоговора, СоставИНастройкиОтчетов.Отчет, СоставИНастройкиОтчетов.Периодичность, СоставИНастройкиОтчетов.Настройка) В
		|			(ВЫБРАТЬ
		|				_НаборЗаписей.Организация КАК Организация,
		|				_НаборЗаписей.Субъект КАК Субъект,
		|				_НаборЗаписей.ВидДоговора КАК ВидДоговора,
		|				_НаборЗаписей.Отчет КАК Отчет,
		|				_НаборЗаписей.Периодичность КАК Периодичность,
		|				_НаборЗаписей.Настройка КАК Настройка
		|			ИЗ
		|				_НаборЗаписей КАК _НаборЗаписей)
		|
		|СГРУППИРОВАТЬ ПО
		|	СоставИНастройкиОтчетов.Организация,
		|	СоставИНастройкиОтчетов.Субъект,
		|	СоставИНастройкиОтчетов.ВидДоговора,
		|	СоставИНастройкиОтчетов.Отчет,
		|	СоставИНастройкиОтчетов.Периодичность,
		|	СоставИНастройкиОтчетов.Настройка,
		|	СоставИНастройкиОтчетов.ВидЗначения,
		|	СоставИНастройкиОтчетов.Значение,
		|	СоставИНастройкиОтчетов.Приоритет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПерваяСтрокаФормировать.Период КАК Период,
		|	_ПерваяСтрокаФормировать.Организация КАК Организация,
		|	_ПерваяСтрокаФормировать.Субъект КАК Субъект,
		|	_ПерваяСтрокаФормировать.ВидДоговора КАК ВидДоговора,
		|	_ПерваяСтрокаФормировать.Отчет КАК Отчет,
		|	_ПерваяСтрокаФормировать.Периодичность КАК Периодичность,
		|	_ПерваяСтрокаФормировать.Настройка КАК Настройка,
		|	_ПерваяСтрокаФормировать.ВидЗначения КАК ВидЗначения,
		|	_ПерваяСтрокаФормировать.Значение КАК Значение,
		|	_НаборЗаписей.Период КАК ДатаОтменыФормирования
		|ИЗ
		|	_ПерваяСтрокаФормировать КАК _ПерваяСтрокаФормировать
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _НаборЗаписей КАК _НаборЗаписей
		|		ПО _ПерваяСтрокаФормировать.Период > _НаборЗаписей.Период";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		Возврат;		
	КонецЕсли;
	
	ТекстСообщения = "Нельзя отменить формирование отчета ранее, чем оно было включено:";
	
	Пока Выборка.Следующий() Цикл
		
		ТекстСообщения = ТекстСообщения + СтрШаблон("
							|Организация: '%1'
							|Субъект: '%2'
							|Вид договора: '%3'
							|Отчет: '%4'
							|Периодичность: '%5'
							|Настройка: '%6'
							|Вид значения: '%7'
							|Значение: '%8'
							|Период: '%9'
							|Дата отмены формирования: '%10'.",
							Выборка.Организация,
							Выборка.Субъект,
							Выборка.ВидДоговора,
							Выборка.Отчет,
							Выборка.Периодичность,
							Выборка.Настройка,
							Выборка.ВидЗначения,
							Выборка.Значение,
							Формат(Выборка.Период, "ДФ=dd.MM.yyyy"),
							Формат(Выборка.ДатаОтменыФормирования, "ДФ=dd.MM.yyyy"));
							
	КонецЦикла;
						
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ);
	
	#КонецОбласти
	  	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если Отбор.Количество() = 0
		ИЛИ ЭтотОбъект.ДополнительныеСвойства.Свойство("ОтключитьКонтрольИОповещения")
			И ЗначениеЗаполнено(ЭтотОбъект.ДополнительныеСвойства.ОтключитьКонтрольИОповещения)
			И ЭтотОбъект.ДополнительныеСвойства.ОтключитьКонтрольИОповещения Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("НаборЗаписей",	ЭтотОбъект.Выгрузить());
	
	Запрос.Текст =
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НаборЗаписей.Период КАК Период,
		|	НаборЗаписей.Организация КАК Организация,
		|	НаборЗаписей.Субъект КАК Субъект,
		|	НаборЗаписей.ВидДоговора КАК ВидДоговора,
		|	НаборЗаписей.Отчет КАК Отчет,
		|	НаборЗаписей.Периодичность КАК Периодичность,
		|	НаборЗаписей.Настройка КАК Настройка
		|ПОМЕСТИТЬ _НаборЗаписей
		|ИЗ
		|	&НаборЗаписей КАК НаборЗаписей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СоставИНастройкиОтчетов.Период КАК Период,
		|	СоставИНастройкиОтчетов.Организация КАК Организация,
		|	СоставИНастройкиОтчетов.Субъект КАК Субъект,
		|	СоставИНастройкиОтчетов.ВидДоговора КАК ВидДоговора,
		|	СоставИНастройкиОтчетов.Отчет КАК Отчет,
		|	СоставИНастройкиОтчетов.Периодичность КАК Периодичность,
		|	СоставИНастройкиОтчетов.Настройка КАК Настройка,
		|	СоставИНастройкиОтчетов.ВидЗначения КАК ВидЗначения,
		|	СоставИНастройкиОтчетов.Значение КАК Значение,
		|	СоставИНастройкиОтчетов.Приоритет КАК Приоритет
		|ПОМЕСТИТЬ _ДанныеРегистра
		|ИЗ
		|	РегистрСведений.СоставИНастройкиОтчетов КАК СоставИНастройкиОтчетов
		|ГДЕ
		|	(СоставИНастройкиОтчетов.Организация, СоставИНастройкиОтчетов.Субъект, СоставИНастройкиОтчетов.ВидДоговора, СоставИНастройкиОтчетов.Отчет, СоставИНастройкиОтчетов.Периодичность, СоставИНастройкиОтчетов.Настройка) В
		|			(ВЫБРАТЬ
		|				_НаборЗаписей.Организация КАК Организация,
		|				_НаборЗаписей.Субъект КАК Субъект,
		|				_НаборЗаписей.ВидДоговора КАК ВидДоговора,
		|				_НаборЗаписей.Отчет КАК Отчет,
		|				_НаборЗаписей.Периодичность КАК Периодичность,
		|				_НаборЗаписей.Настройка КАК Настройка
		|			ИЗ
		|				_НаборЗаписей КАК _НаборЗаписей)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_НаборЗаписей.Период КАК Период,
		|	_НаборЗаписей.Организация КАК Организация,
		|	_НаборЗаписей.Субъект КАК Субъект,
		|	_НаборЗаписей.ВидДоговора КАК ВидДоговора,
		|	_НаборЗаписей.Отчет КАК Отчет,
		|	_НаборЗаписей.Периодичность КАК Периодичность,
		|	_НаборЗаписей.Настройка КАК Настройка,
		|	МИНИМУМ(_ДанныеРегистра.Период) КАК Дата
		|ПОМЕСТИТЬ _ДатаСледующейНастройки
		|ИЗ
		|	_НаборЗаписей КАК _НаборЗаписей
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДанныеРегистра КАК _ДанныеРегистра
		|		ПО _НаборЗаписей.Период < _ДанныеРегистра.Период
		|			И _НаборЗаписей.Организация = _ДанныеРегистра.Организация
		|			И _НаборЗаписей.Субъект = _ДанныеРегистра.Субъект
		|			И _НаборЗаписей.ВидДоговора = _ДанныеРегистра.ВидДоговора
		|			И _НаборЗаписей.Отчет = _ДанныеРегистра.Отчет
		|			И _НаборЗаписей.Периодичность = _ДанныеРегистра.Периодичность
		|			И _НаборЗаписей.Настройка = _ДанныеРегистра.Настройка
		|
		|СГРУППИРОВАТЬ ПО
		|	_НаборЗаписей.Период,
		|	_НаборЗаписей.Организация,
		|	_НаборЗаписей.Субъект,
		|	_НаборЗаписей.ВидДоговора,
		|	_НаборЗаписей.Отчет,
		|	_НаборЗаписей.Периодичность,
		|	_НаборЗаписей.Настройка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_ДатаСледующейНастройки.Период КАК Период,
		|	_ДатаСледующейНастройки.Организация КАК Организация,
		|	_ДатаСледующейНастройки.Субъект КАК Субъект,
		|	_ДатаСледующейНастройки.ВидДоговора КАК ВидДоговора,
		|	_ДатаСледующейНастройки.Отчет КАК Отчет,
		|	_ДатаСледующейНастройки.Периодичность КАК Периодичность,
		|	_ДатаСледующейНастройки.Настройка КАК Настройка,
		|	_ДанныеРегистра.Период КАК Дата,
		|	_ДанныеРегистра.ВидЗначения КАК ВидЗначения,
		|	_ДанныеРегистра.Значение КАК Значение
		|ИЗ
		|	_ДатаСледующейНастройки КАК _ДатаСледующейНастройки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _ДанныеРегистра КАК _ДанныеРегистра
		|		ПО _ДатаСледующейНастройки.Дата = _ДанныеРегистра.Период
		|			И _ДатаСледующейНастройки.Организация = _ДанныеРегистра.Организация
		|			И _ДатаСледующейНастройки.Субъект = _ДанныеРегистра.Субъект
		|			И _ДатаСледующейНастройки.ВидДоговора = _ДанныеРегистра.ВидДоговора
		|			И _ДатаСледующейНастройки.Отчет = _ДанныеРегистра.Отчет
		|			И _ДатаСледующейНастройки.Периодичность = _ДанныеРегистра.Периодичность
		|			И _ДатаСледующейНастройки.Настройка = _ДанныеРегистра.Настройка";
	#КонецОбласти
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = "Внимание! Периоды действия настроек ограничены началом действия следующих значений настроек:";
	
	Пока Выборка.Следующий() Цикл
		
		ТекстСообщения = ТекстСообщения + СтрШаблон("							
							|Период: '%1'
							|Организация: '%2'
							|Субъект: '%3'
							|Вид договора: '%4'
							|Отчет: '%5'
							|Периодичность: '%6'
							|Настройка: '%7'
							|Дата следующего значения: '%8'
							|Вид значения: '%9'
							|Значение: '%10'.",
							Формат(Выборка.Период, "ДФ=dd.MM.yyyy"),
							Выборка.Организация,
							Выборка.Субъект,
							Выборка.ВидДоговора,
							Выборка.Отчет,
							Выборка.Периодичность,
							Выборка.Настройка,
							Формат(Выборка.Дата, "ДФ=dd.MM.yyyy"),
							Выборка.ВидЗначения,
							Выборка.Значение);
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры
